public_html/java/java-new-feature.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 15:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="renshuo" />
<link rel="stylesheet" type="text/css" href="/blog/public_html/theme/css/worg.css"/>
                       <link rel="stylesheet" type="text/css" href="/gitPage/public_html/theme/css/worg.css"/>
                       <link rel="stylesheet" type="text/css" href="theme/css/worg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org93f5e10">JDK 新特性</a>
<ul>
<li><a href="#org30b1119">JDK8</a></li>
<li><a href="#org9b40796">lamba</a></li>
<li><a href="#org23e7760">闭包</a></li>
<li><a href="#org6b92d69">Stream(jdk8)</a></li>
<li><a href="#org0a86251">JDK9</a></li>
<li><a href="#org6a0bcb3">模块系统</a></li>
<li><a href="#org81dd81f">REPL</a></li>
<li><a href="#orgdd9a354">interface 私有方法</a></li>
<li><a href="#orga42f924">JDK10</a></li>
<li><a href="#org3565d5f">类型推断 var (jdk10)</a></li>
<li><a href="#org9e071b1">JDK11</a></li>
<li><a href="#org714b19e">其他</a></li>
<li><a href="#org19b2f45">JIT</a></li>
<li><a href="#org8783282">AOT</a></li>
<li><a href="#org8877532">Graal</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org93f5e10" class="outline-2">
<h2 id="org93f5e10">JDK 新特性</h2>
<div class="outline-text-2" id="text-org93f5e10">
</div>
<div id="outline-container-org30b1119" class="outline-3">
<h3 id="org30b1119">JDK8</h3>
</div>
<div id="outline-container-org9b40796" class="outline-3">
<h3 id="org9b40796">lamba</h3>
</div>


<div id="outline-container-org23e7760" class="outline-3">
<h3 id="org23e7760">闭包</h3>
<div class="outline-text-3" id="text-org23e7760">
<p>
`
`
</p>
</div>
</div>
<div id="outline-container-org6b92d69" class="outline-3">
<h3 id="org6b92d69">Stream(jdk8)</h3>
<div class="outline-text-3" id="text-org6b92d69">
<p>
`
List&lt;String&gt; sl = new ArrayList&lt;String&gt;();
&#x2026;
sl.stream().map(a -&gt; {&#x2026;}).reduce( (r0, i) -&gt; {&#x2026;})
</p>
</div>
</div>

<div id="outline-container-org0a86251" class="outline-3">
<h3 id="org0a86251">JDK9</h3>
</div>
<div id="outline-container-org6a0bcb3" class="outline-3">
<h3 id="org6a0bcb3">模块系统</h3>
<div class="outline-text-3" id="text-org6a0bcb3">
<p>
module-info.java
</p>
</div>
</div>
<div id="outline-container-org81dd81f" class="outline-3">
<h3 id="org81dd81f">REPL</h3>
</div>
<div id="outline-container-orgdd9a354" class="outline-3">
<h3 id="orgdd9a354">interface 私有方法</h3>
</div>

<div id="outline-container-orga42f924" class="outline-3">
<h3 id="orga42f924">JDK10</h3>
</div>
<div id="outline-container-org3565d5f" class="outline-3">
<h3 id="org3565d5f">类型推断 var (jdk10)</h3>
<div class="outline-text-3" id="text-org3565d5f">
<p>
`var list = new ArrayList&lt;String&gt;();`
</p>
</div>
</div>

<div id="outline-container-org9e071b1" class="outline-3">
<h3 id="org9e071b1">JDK11</h3>
<div class="outline-text-3" id="text-org9e071b1">
<ol class="org-ol">
<li>JEP 330: 支持单文件程序，整个程序只有一个源码文件，HelloWorld：</li>
<li>ZGC： 新的垃圾收集器，降低了 STW 的时长，达到毫秒级</li>
<li>Epsilon：只分配，不回收的垃圾收集器，用于性能测试</li>
<li>新的 Http client，支持 http/2 和 websocket</li>
<li>List 接口的 of 方法，用于快速创建 List，toArray()支持将 List 转换为数组</li>
<li>Files 类增加 writeString 和 readString 方法，方便文件和 String 操作。</li>
<li>String 增加了 strip，可以去掉 Unicode 空格，比如中文空格；isBlank 判定是否为空字符串；lines 将 string 分割为行的字符串数组；repeat 方法可以指定重复次数</li>
</ol>
</div>
</div>

<div id="outline-container-org714b19e" class="outline-3">
<h3 id="org714b19e">其他</h3>
</div>
<div id="outline-container-org19b2f45" class="outline-3">
<h3 id="org19b2f45">JIT</h3>
<div class="outline-text-3" id="text-org19b2f45">
<p>
just in time compile, 即时编译，在运行过程中对热点代码进行本地编译以提高性能
</p>
</div>
</div>

<div id="outline-container-org8783282" class="outline-3">
<h3 id="org8783282">AOT</h3>
<div class="outline-text-3" id="text-org8783282">
<p>
ahead of time: 运行前编译，使用编译器将代码编译为目标机器的机器码。
</p>
</div>
</div>


<div id="outline-container-org8877532" class="outline-3">
<h3 id="org8877532">Graal</h3>
<div class="outline-text-3" id="text-org8877532">
<ol class="org-ol">
<li>硬件层：x86, arm &#x2026;</li>
<li>操作系统: Linux, windows, android, ios</li>
<li>软件虚拟层: JVM, 浏览器, .net/mono</li>
<li>应用层： 各种软件</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: renshuo</p>
<p class="date">Created: 2020-03-26 四 15:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
